In [4]:
import pandas as pd
import sqlite3

df=pd.read_csv('Ecommerce Shipping Data.csv')
df.head()

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms,Reached.on.Time_Y.N
0,1,D,Flight,4,2,177,3,low,F,44,1233,1
1,2,F,Flight,4,5,216,2,low,M,59,3088,1
2,3,A,Flight,2,2,183,4,low,M,48,3374,1
3,4,B,Flight,3,3,176,4,medium,M,10,1177,1
4,5,C,Flight,2,2,184,3,medium,F,46,2484,1

In [5]:
df['Mode_of_Shipment'].unique()

array(['Flight', 'Ship', 'Road'], dtype=object)

In [6]:
df.shape

(10999, 12)

In [7]:
df.duplicated().sum()

0

In [8]:
df.isnull().sum()

ID                     0
Warehouse_block        0
Mode_of_Shipment       0
Customer_care_calls    0
Customer_rating        0
Cost_of_the_Product    0
Prior_purchases        0
Product_importance     0
Gender                 0
Discount_offered       0
Weight_in_gms          0
Reached.on.Time_Y.N    0
dtype: int64

In [9]:
df.columns

Index(['ID', 'Warehouse_block', 'Mode_of_Shipment', 'Customer_care_calls',
       'Customer_rating', 'Cost_of_the_Product', 'Prior_purchases',
       'Product_importance', 'Gender', 'Discount_offered', 'Weight_in_gms',
       'Reached.on.Time_Y.N'],
      dtype='object')

In [10]:

import sqlite3

# Create SQLite DB in memory
conn = sqlite3.connect(':memory:')

# Write DataFrame to SQL table
df.to_sql('my_table', conn, index=False, if_exists='replace')

# Run SQL query
query = "SELECT Customer_rating FROM my_table where Customer_rating >3;"
result_df = pd.read_sql_query(query, conn)

# Show results
print(result_df)

      Customer_rating
0                   5
1                   4
2                   4
3                   4
4                   5
...               ...
4355                4
4356                5
4357                4
4358                4
4359                5

[4360 rows x 1 columns]

In [12]:
query = "SELECT Customer_rating, count(*) as count FROM my_table GROUP BY Customer_rating ORDER BY Customer_rating;"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   Customer_rating  count
0                1   2235
1                2   2165
2                3   2239
3                4   2189
4                5   2171

In [13]:
query = "SELECT Customer_rating, sum(Cost_of_the_Product) FROM my_table where Customer_rating GROUP BY Customer_rating ORDER BY Customer_rating;"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   Customer_rating  sum(Cost_of_the_Product)
0                1                    467070
1                2                    457653
2                3                    468812
3                4                    459981
4                5                    458439

In [14]:
query = "SELECT Customer_rating, avg(Cost_of_the_Product) FROM my_table where Customer_rating GROUP BY Customer_rating ORDER BY Customer_rating;"
result_df = pd.read_sql_query(query, conn)
print(result_df)

   Customer_rating  avg(Cost_of_the_Product)
0                1                208.979866
1                2                211.387067
2                3                209.384547
3                4                210.132937
4                5                211.164901

In [20]:
query = """SELECT a.ID AS shipment1_id, b.ID AS shipment2_id,
a.Customer_rating FROM my_table a JOIN my_table b  
ON a.Customer_rating = b.Customer_rating 
WHERE a.ID < b.ID;"""
result_df = pd.read_sql_query(query, conn)
print(result_df)

          shipment1_id  shipment2_id  Customer_rating
0                    1             3                2
1                    1             5                2
2                    1            10                2
3                    1            34                2
4                    1            35                2
...                ...           ...              ...
12094762         10993         10995                1
12094763         10993         10996                1
12094764         10994         10995                1
12094765         10994         10996                1
12094766         10995         10996                1

[12094767 rows x 3 columns]